const Rules = () => {
    return (
        <>
            <p>
                Для того, чтобы начать игру, необходимо выбрать режим игры,
                сложность и расставить корабли.
            </p>
            <p>
                В режиме "По очереди" ходы будут чередоваться вне зависимости от
                того, попали Вы или нет и попал Робот или нет.
            </p>
            <p>В режиме "До промаха" ходы осуществляются до первого промаха.</p>
            <p>
                При лёгком уровне сложности, противник очень слаб, поэтому, если
                Вы себя недооцениваете, то можете выбрать данный уровень
                сложности.
            </p>
            <p>
                При среднем уровне сложности, противник является чем-то средним,
                между человеком и сверхмашиной, если вы оцениваете себя в этом
                диапазоне, то можете выбрать данный уровень сложности.
            </p>
            <p>
                При сложном уровне сложности, противник - это настоящая машина
                для анигиляции кораблей, если Вы готовы соперничать с божеством
                во плоти нескольких строчек кода, тогда данный уровень сложности
                для Вас.
            </p>
            <p>
                Расстановка кораблей очень проста, Вы можете выбрать
                автоматическую расстановку или перетащить корабли в то место,
                куда хотите, только не себе в карман (опционально).
            </p>
            <p>
                После настройки можно и поиграть, чтобы начать игру нажмите
                "Играть".
            </p>
            <p>
                Если по какой-то причине вы не захотели больше наслаждаться
                игрой с машиной (она Вас побеждает), можно закончить игру, нажав
                кнопку "Закончить", однако в этом случае победа присуждается
                бездушной и глупой машине (а что делать, такова жизнь...).
            </p>
        </>
    );
};

export default Rules;
