const Rules = (): JSX.Element => {
    return (
        <>
            <p>
                Для того, чтобы начать игру, необходимо расставить корабли
                вручную или автоматически.
            </p>
            <p>
                После того, как Вас устраивает расположение флотилии, для начала
                игры нужно нажать кнопки "Принять", а затем "Играть". После чего
                начнется великое сражение.
            </p>
            <p>Ходы в игре осуществляются до первого промаха.</p>
            <p>
                Если по какой-то причине Вы не захотели больше наслаждаться
                игрой, ее можно завершить, нажав кнопку "Закончить", однако в
                этом случае победа присуждается противнику.
            </p>
            <p>Приятного времяпрепровождения и хорошей игры!</p>
        </>
    );
};

export default Rules;
